VV_cases/V2_thermal/results/study_v2a/runs/006_data_v2_production_like_short/simulations/Re10_prodLike/openfoam_setup/constant/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight       28.9;
    }
    equationOfState
    {
        rho0            1.205000;
        T0              293.15;
        beta            3.411222923e-03;
    }
    thermodynamics
    {
        Cv              1005.000000;
        hf              0;
    }
    transport
    {
        mu              1.827000000e-05;
        Pr              0.713000;
    }
}
