VV_cases/V2_thermal/results/study_v2a/runs/006_data_v2_production_like_short/simulations/Re10_prodLike/openfoam_setup/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 8;
method scotch;
