VV_cases/V2_thermal/results/study_v2a/runs/006_data_v2_production_like_short/simulations/Re10_prodLike/openfoam_setup/Allrun
#!/usr/bin/env bash
export ZSH_NAME="${ZSH_NAME-}"
source /opt/openfoam13/etc/bashrc
set -euo pipefail
cd "$(dirname "$0")"
mkdir -p logs
blockMesh | tee logs/log.blockMesh
snappyHexMesh -overwrite | tee logs/log.snappyHexMesh
checkMesh -allTopology -allGeometry | tee logs/log.checkMesh
postProcess -func writeCellCentres -time 0 | tee logs/log.writeCellCentres
decomposePar -force | tee logs/log.decomposePar
mpirun --use-hwthread-cpus -np 8 foamRun -solver fluid -parallel | tee logs/log.foamRun
